In [1]:
import pandas as pd

url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
df = pd.read_csv(url)         # Read data from the specified url
#df.head()

1.Delete unnamed columns

In [2]:
df.drop(df.columns[df.columns.str.contains('unnamed',case = False)],axis = 1,inplace=True)
df.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

2.Show the distribution of male and female

In [13]:
print(df.groupby(by='Gender').size().reset_index(name='counts'))

genderDistribution = pd.Categorical(df["Gender"],ordered=True)
genderDistribution.describe()

  Gender  counts
0      F  558846
1      M  457549

            counts     freqs
categories
F           558846  0.549832
M           457549  0.450168

3.Show the top 5 most preferred names

In [15]:
df.groupby('Name').size().sort_values(ascending=False).head()

Name
Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
dtype: int64

4. What is the median name occurence in the dataset

In [5]:
df.groupby('Name').size().sort_values(ascending=False).median()

8.0

5. Distribution of male and female born count by states

In [25]:
print(df.groupby(['Gender','State']).size().reset_index(name='counts'))

    Gender State  counts
0        F    AK    2404
1        F    AL    9878
2        F    AR    7171
3        F    AZ   14518
4        F    CA   45144
5        F    CO   11424
6        F    CT    6575
7        F    DC    3053
8        F    DE    2549
9        F    FL   25781
10       F    GA   19385
11       F    HI    3255
12       F    IA    7131
13       F    ID    4918
14       F    IL   21268
15       F    IN   13056
16       F    KS    7753
17       F    KY    8817
18       F    LA   10510
19       F    MA   10580
20       F    MD   11276
21       F    ME    2976
22       F    MI   16038
23       F    MN   10677
24       F    MO   11948
25       F    MS    7235
26       F    MT    2690
27       F    NC   17357
28       F    ND    2399
29       F    NE    5370
..     ...   ...     ...
72       M    ME    2777
73       M    MI   13243
74       M    MN    9004
75       M    MO    9917
76       M    MS    6862
77       M    MT    2986
78       M    NC   13530
79       M    ND    2581
80       M    NE    5029
81       M    NH    2659
82       M    NJ   12274
83       M    NM    4966
84       M    NV    6024
85       M    NY   22585
86       M    OH   14318
87       M    OK    8138
88       M    OR    7333
89       M    PA   14171
90       M    RI    2468
91       M    SC    8195
92       M    SD    2908
93       M    TN   10588
94       M    TX   27791
95       M    UT    8233
96       M    VA   11997
97       M    VT    1618
98       M    WA   11049
99       M    WI    8940
100      M    WV    3733
101      M    WY    1904

[102 rows x 3 columns]